Repository: rowanv/amicus_en_web
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Amicus. Vet Practice Management Software Made Easy.
es: Amicus. Facilitamos la gestión de su clínica veterinaria.

source: Home
es: Inicio

source: About
es: Presentación

source: Why Choose Amicus?
es: ¿Por qué elegir al producto Amicus?

source: Features
es: Características de la aplicación

source: Try It Now!
es: ¡Haga la prueba ahora!

source: Questions? Contact Us!
es: ¿Tiene alguna pregunta? ¡Contáctenos!

source: amicus [at] horossolutions [dot] com
es: amicus [arroba] horossolutions [punto] com

source: Vet Practice Management Software Made Easy.
es: Amicus. Facilitamos la gestión de su clínica veterinaria.

source: Find Out More
es: Aprenda más sobre nuestro producto

source: What does the future of vet management software look like?
es: ¿Cuál será el futuro de las prácticas de gestión de las clínicas veterinarias?

source: Fast. Dependable. Secure. Easy to use.
es: Una aplicación rápida. Fiable. Segura. Fácil de utilizar.

source: The best part? The future is here.
es: La mejor parte es que el futuro ya está aquí hoy.

source: Presenting the Amicus Vet Practice Management Software App.
es: Presentamos la nueva aplicación Amicus, una aplicación de gestión de creada especialmente para las clínicas veterinarias.

source: In The Cloud
es: Software en la nube

source: Amicus runs in the cloud. No more worrying about backups. Access your data from anywhere.
es: El programa Amicus se ejecuta en la Nube. Ya no es necesario preocuparse por los respaldos de su información. Usted puede acceder a su información desde cualquier lugar.

source: Learn More
es: Aprenda más acerca <br>de nuestro producto.

source: Intuitive Interface
es: Interfáz de manejo intuitivo

source: No more hours of training just to find and use basic functionalities. You'll be ready to use Amicus from day 1.
es: Ya no es necesario recibir horas de entrenamiento para utilizar las funciones básicas de los programas de gestión. Podrá utilizar Amicus desde el primer día.

source: Innovative
es: Innovador

source: We use cutting-edge technology to bring you a lightning-fast, responsive web application.
es: Nosotros utilizamos la última tecnología para crear una aplicación con velocidades extremadamente rápidas y una aplicación con diseño web adaptable.

source: Secure
es: Seguro

source: All of your data is stored in our professionally-managed data warehouses around the world.
es: Toda su información se almacena en Centros de Datos los cuales son monitoreados profesionalmente y se encuentran en diversas regiones del mundo.

source: Appointment Scheduling
es: Programación de citas

source: Easily schedule appointments, view existing appointments, and manage multiple vets' schedules.
es: Haga citas fácilmente, vea citas ya enregistradas, y maneje el calendario de citas de varios veterinarios de manera simultánea.

source: Manage Patient Histories
es: Maneje las historias de sus pacientes

source: Use electronic medical records to easily summarize your patient histories.
es: Use los historiales clínicos electrónicos para resumir fácilmente las historias clínicas de sus pacientes.

source: Manage Your Communications
es: Maneje sus comunicaciones

source: Send out mailing lists, appointment reminders, and more.
es: Envie boletines a sus listas de correo electrónico, recordatorios de citas, y mucho más.

source: Worry-free Data
es: Sistema de respaldo de datos sin preocupación

source: Your data is safe in our professionally-managed data centers. Backups occur automatically, so you can focus your time and energy on what's important: your patients and their guardians. You can also access your data from any device, at any place, at any time.
es: Sus datos se almacenan de forma segura en nuestros Centros de Datos. Los respaldos ocurren de manera automática, lo cual permite que usted se centre en lo que es más importante: las mascotas y sus dueños. Usted también puede tener acceso a sus datos desde cualquier ordenador o dispositivo en cualquier lugar y en cualquier moment.

source: No Long Staff Training Sessions
es: El personal que utilizará el producto no requerirá largos entrenamientos

source: Our product doesn't ship with a 200-page long manual. Why? It's easy to use. We provide helpful tips and tricks throughout your onboarding process, as well as an intuitive interface, so that you're able to hit the ground running from Day 1.
es: Nosotros no enviamos manuales de más de 200 páginas junto con nuestro producto. ¿Por qué? Porque es fácil utilizarlo. Usted recibirá consejos y sugerencias a través del producto durante el proceso de incorporación, junto con un interfáz de manejo intuitivo, para que usted pueda empezar a trabajar de una forma inmediata y efectiva desde el primer día.

source: Easily Check Patients In
es: Registre la llegada de sus pacientes con facilidad

source: You can check patients in with just 3 clicks. With an easy-to-use interface, you can either manage check-ins yourself, or set up a tablet and have patients check themselves in using our mobile-compatible application.
es: Usted puede registrar la llegada de sus pacientes con tan solo 3 clics. Como resultado del interfaz de manejo intuitivo, usted puede manejar el proceso de enregistramiento, o puede usar una tableta para que sus pacientes completen el proceso ellos mismos utilizando nuestra aplicación compatible con dispositivos móviles.

source: Try out Amicus using our free, 30-day trial.
es: ¡Aproveche de nuestra prueba gratuita de 30 días y utilize nuestra aplicación!

source: Sign Up Now!
es: ¡Regístrese ahora!

source: Amicus is currently in private beta. Sign up now to get free access.
es: La aplicación Amicus está actualmente disponible en fase beta privada. Regístrese ahora para recibir acceso gratuito.

source: indicates required
es: indica que es obligatorio

source: Email Address
es: Dirección de email

source: Preferred language:
es: Idioma preferido

source: English
es: Inglés

source: Spanish
es: Español

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: Subscribe
es: Registración
